#### File Info ###############################
##
##  File_name : GitHub_Commit_Message_Rule.R
##  Desc      : Description
##  Author    : GomGuard
##  Creted    : 2020-05-28
## 
##############################################  

GIt Commit Message Prefix

한글로 작성 

[기능] - 기능 추가, 삭제, 변경 (핵심 코드 수정발생)
[버그] - 버그 수정 (핵심 코드 수정발생)
[리팩] - 코드 리팩토링 (핵심 코드 수정발생)
[형식] - 코드 형식, 주석, 정렬 변경 (핵심 코드 수정발생, 기능 영향 없음)
[테스트] - 테스트 관련 코드 추가, 삭제, 변경 (핵심 코드 수정없음, 테스트 관련 코드만 추가)
[문서] - 문서 추가,삭제,변경, 파일 이름변경, 위치이동 (핵심 코드 수정없음)
[기타] - 기타 상위 카테로기에 속하지 않는 모든 경우

커밋은 수정사항별로 가급적 나누어서
ex)  [기능] 모델 작동환경 변경

본문 작성 시 최대한 상세하게 파일별로 구분해서

꼬리말 작성시


REF.
# https://tttsss77.tistory.com/58